<div class="titre">Suite harmonique</div>
<div>
  Les &ldquo;Suites harmoniques&rdquo; permettent de travailler un exercice en passant en revue toutes les tonalit&eacute;s, mais de fa&ccedil;on plut&ocirc;t agr&eacute;able musicalement.
</div>
<div>
  Dans le cadre de cette application, on trouve plusieurs sortes de suites harmoniques&nbsp;:
</div>
<ul>
  <li><a href="#suite_maj_to_rel">Du Majeur au Relatif (ou inversement)</a>&nbsp;;</li>
  <li><a  href="#suite_demi_ton">Par demi-ton</a>&nbsp;;</li>
  <li><a  href="#suite_par_ton">Selon les touches blanches</a> (&agrave; la mani&egrave;re des Hanon).</li>
</ul>
<!-- Dans l'application -->
<div class="soustitre">Suites harmoniques dans l'application</div>
<div>
  Vous pouvez d&eacute;finir pour chaque s&eacute;ance de travail le type de suite qui doit &ecirc;tre utilis&eacute; pour l'exercice. Cela permet surtout de d&eacute;finir, suivant les <aide value="config-generale/presentation" title="Configuration g&eacute;n&eacute;rales des exercices" /> quelle suite exacte sera utilis&eacute;e au cours de la s&eacute;ance (Majeur vers Relatif ou Relatif vers Majeur par exemple). Voir le fichier d'aide <aide value="config-generale/definir-suite-harmonique" title="D&eacute;finir la suite harmonique de l'exercice" /> pour le d&eacute;tail.  
</div>

<!-- Description des suites -->

<!-- Suite Maj vers Rel -->
<div id="suite_maj_to_rel">
  <div class="soustitre">
    Suite harmonique &ldquo;Majeur vers Relatif&rdquo; (ou inversement)
  </div>
  <div class="center">
    <img data-src="ex/suite/maj_to_rel.png" style="width:90%;" />
  </div>
  <div>
    La suite harmonique &ldquo;Majeur vers Relatif&rdquo; consiste &agrave; partir du ton Majeur (par exemple DO Majeur) puis de passer ensuite au ton relatif mineur de ce ton majeur (c'est-&agrave;-dire LA mineur dans le cas de DO Majeur) et de progresser ainsi de quarte en quarte (DO Majeur vers FA Majeur vers SIb Majeur, etc.).
  </div>
  <div>
    La suite harmonique &ldquo;Relatif vers Majeur&rdquo; fait l'inverse (ou le contraire, c'est selon ;-)&nbsp;: elle part du ton Relatif mineur (p.e. LA mineur) et passe au ton Majeur (p.e. DO Majeur dans le cas du LA mineur). Et elle proc&egrave;de ainsi de quinte en quinte (DO -> SOL -> R&Eacute; -> LA, etc.)
  </div>
  <div>
    <img data-src="ex/suite/rel_to_maj.png" style="width:90%;" />
  </div>
</div>
<!-- Suite par demi-ton -->
<div id="suite_demi_ton">
  <div class="soustitre">
    Suite harmonique par demi-ton
  </div>
  <div>
    <img data-src="ex/suite/par_demi_ton.png" style="width:90%" />
  </div>
  <div>
    Cette suite consiste tout simplement &agrave; monter un motif (par exemple des octaves) de demi-ton en demi-ton&nbsp;: d'abord sur la gamme de DO Majeur, ensuite sur R&eacute; b&eacute;mol Majeur, ensuite R&eacute; Majeur, ensuite Mi b&eacute;mol Majeur, etc.
  </div>
  <div>
    Elle est utilis&eacute;e par exemple pour certains exercices sur les octaves.
  </div>
</div>
<!-- Suite par ton -->
<div id="suite_par_ton">
  <div class="soustitre">
    Suite harmonique selon les touches blanches
  </div>
  <div>
    <img data-src="ex/suite/par_touches_blanches.png" style="width:90%;" />
  </div>
  <div>
    Il consiste &agrave; reproduire un m&ecirc;me motif en montant ou en descendant sur les touches blanche. par exemple on commence par un arp&egrave;ge de DO 7e de dominante (touche blanche DO), puis on passe &agrave; un arp&egrave;ge de R&Eacute; 7e de dominante (touche blanche R&Eacute;) puis on passe &agrave; MI 7e de dominante (touche blanche MI) puis &agrave; FA 7e de dominante (touche blanche FA), etc. avec SOL, LA et SI avant de revenir &agrave; DO.
  </div>
  <div>
    C'est typiquement Charles-Louis HANON (1819-1900) qui a d&eacute;velopp&eacute; les exercices les plus connus pour ce type de suite.
  </div>
</div>