<div class="titre">Ajout d'exercices &agrave; la feuille de route</div>
<div>
  Avant de pouvoir ajouter des exercices, vous devez imp&eacute;rativement avoir <aide value="roadmap/creation">cr&eacute;&eacute; une feuille de route</aide> ou avoir <aide value="roadmap/load">ouvert une de vos feuilles de route<aide>.
</div>
<div>
  C'est seulement lorsqu'une de vos feuilles de route est ouverte que le bouton <focus value="a#btn_exercice_create">Nouvel exercice</focus> apparait.
</div>
<div>
  Si ce bouton est visible, vous pouvez donc <strong>cliquer dessus pour initier un nouvel exercice</strong> . Un formulaire s'ouvre devant vos yeux &eacute;bahis. C'est le formulaire o&ugrave; vous allez d&eacute;finir les &ldquo;param&egrave;tres&rdquo; de votre nouvel exercice.
</div>
<div class="bold">
  Notons pour commencer le premier bouton, tout en haut, qui va &eacute;norm&eacute;ment vous simplifier la vie. Il vous permet d'avoir acc&egrave;s &agrave; une base de donn&eacute;es d'exercices qu'il suffit de choisir pour les ajouter &agrave; votre feuille de route.
</div>
<div class="italic">
  (Cette base de donn&eacute;es grossit de jour en jour, n'h&eacute;sitez pas &agrave; soumettre une demande pour un exercice qui n'existerait pas encore, par le biais du formulaire de <focus value="a#mail_to_phil">contact par mail</focus>. Cet exercice sera rentr&eacute; en priorit&eacute;.)
</div>
<div>
  Si vous voulez tout de suite savoir comment ajouter des exercices depuis la base de donn&eacute;es, rejoignez l'article <aide value="exercice/add_from_db.html">Ajouter un exercice de la base de donn&eacute;es des exercices</aide>. Dans le cas contraire, si vous voulez apprendre &agrave; faire un exercice particulier, poursuivez cet article.
</div>
<!-- Description des champs du formulaire -->
<div class="soustitre">Description des champs</div>
<ul>
  <li>
    Le <focus value="exercice_recueil">champ &ldquo;Recueil&rdquo;</focus> contient le titre du livre d'o&ugrave; est issu l'exercice ou l'&eacute;tude (p.e. &ldquo;&Eacute;tudes op. 25&rdquo;). Cette valeur peut &ecirc;tre omise.
  </li>
  <li>
    Le <focus value="exercice_titre">champ &ldquo;Titre&rdquo;</focus> contient&hellip; le titre de l'exercice, qui peut se r&eacute;sumer &agrave; un &ldquo;n&deg;12&rdquo; si le recueil est d&eacute;fini. Ce titre est obligatoire.
  </li>
  <li>
    Le <focus value="exercice_auteur">champ Auteur</focus> d&eacute;finit l'auteur de l'exercice, en d'autres termes&nbsp;: le compositeur ;-).
  </li>
  <li>
    Sous ces trois champs g&eacute;n&eacute;raux se trouve deux cases &agrave; cocher dont vous n'aurez peut-&ecirc;tre pas besoin tout de suite. Je les explique bri&egrave;vement&nbsp;:<ul>
      <li>La <focus value="span#span_obligatory">case &ldquo;Obligatoire&rdquo;</focus> permet de d&eacute;finir un exercice qu'il faudra imp&eacute;rativement ajouter &agrave; une session de travail, lorsque vous demandez &agrave; Feuille de Route de vous confectionner une s&eacute;ance de travail.</li>
      <li>La <focus value="span#span_with_next">case &ldquo;Li&eacute; au suivant&rdquo;</focus> permet de lier cet exercice au suivant, c'est-&agrave;-dire que vous les jouerez sans vous arr&ecirc;ter, et Feuille de Route r&eacute;partira le temps total de travail entre ces deux exercices (car Feuille de Route m&eacute;morise votre temps de travail pour vous proposer une vision plus pr&eacute;cise de vos efforts sur le court et le long terme)</li>
      </ul>
  </li>
  <li>
    Sous ces cases &agrave; cocher se trouve la d&eacute;finition des types de difficult&eacute;s abord&eacute;es par l'exercice. Ouvrez la liste en cliquant sur <focus value="a#btn_toggle_types_exercices">le bouton &ldquo;modifier&hellip;&rdquo;</focus> puis cocher toutes les difficult&eacute;s requises.
    <br>
    <i>Notez que cette d&eacute;finition est particuli&egrave;rement importante si vous voulez obtenir des rapports de travail int&eacute;ressants. En effet, &ldquo;Feuille de Route Musicale&rdquo;, gr&acirc;ce &agrave; ces difficult&eacute;s, pourra vous indiquer votre temps de travail sur chaque difficult&eacute;, pour la s&eacute;ance courante ou une p&eacute;riode d&eacute;finie (par d&eacute;faut&nbsp;: le mois courant). Vous pourrez ainsi savoir sur quelle difficult&eacute; vous avez r&eacute;ellement port&eacute; vos efforts.</i> 
  </li>
  <li>
    La rang&eacute;e &ldquo;Tempi&rdquo; contient trois menus permettant de r&eacute;gler, dans l'ordre&nbsp;:
    <ul>
      <li>Le tempo o&ugrave; vous allez commencer par jouer cet exercice (peut-&ecirc;tre le plus lent, ou l&eacute;g&egrave;rement au-dessus), gr&acirc;ce au <focus value="select#exercice_tempo">menu Tempo</focus>&nbsp;;</li>
      <li>Le tempo le plus lent de l'exercice gr&acirc;ce au <focus value="select#exercice_tempo_min">menu Tempo minimal</focus> (p.e., dans le Hanon, le premier exercice doit se travailler &agrave; 60 &agrave; la noire. Il faudrait donc r&eacute;gler ici &ldquo;60&rdquo;)&nbsp;;</li>
      <li>Le tempo le plus rapide de l'exercice gr&acirc;ce au <focus value="select#exercice_tempo_max">menu Tempo maximal</focus> (p.e. dans le Hanon, le premier serait r&eacute;gl&eacute; &agrave; &ldquo;108&rdquo;).</li>
    </ul>
    <div class="petit italic">
      Le saviez-vous&nbsp;?&hellip; Quand vous vous trouvez sur un menu tels que ceux-l&agrave;, vous pouvez taper les chiffres sur votre pav&eacute; num&eacute;rique pour choisir le nombre voulu, puis taper la touche &ldquo;Entr&eacute;e&rdquo; pour le choisir.
    </div>
  </li>
  <li>
    Le <focus value="select#exercice_tone">menu &ldquo;Tonalit&eacute;&rdquo;</focus> vous permet de d&eacute;finir la tonalit&eacute; de l'exercice, si elle est d&eacute;finie. Notez que si cette tonalit&eacute; n'est pas d&eacute;finie, alors l'exercice sera consid&eacute;r&eacute; comme &ldquo;harmonique&rdquo;, c'est-&agrave;-dire qu'une tonalit&eacute; diff&eacute;rente pourra &ecirc;tre propos&eacute;e &agrave; chaque s&eacute;ance pour le jouer.
  </li>
  <li>
    Le <focus value="exercice_suite">menu &ldquo;Suite&rdquo;</focus> permet de d&eacute;finir la &ldquo;Suite harmonique&rdquo; qui est peut-&ecirc;tre appliqu&eacute; &agrave; l'exercice. Pour le moment, vous pouvez passer cette information. Vous pourrez cliquer sur le &ldquo;?&rdquo; qui apparait &agrave; c&ocirc;t&eacute; du menu lorsque vous glissez votre souris dessus (<i>vous l'avez peut-&ecirc;tre d&eacute;j&agrave; not&eacute;, un point d'interrogation apparait souvent &agrave; c&ocirc;t&eacute; des &eacute;l&eacute;ments que vous survolez de la souris, vous apportant une aide pr&eacute;cise sur l'&eacute;l&eacute;ment en question. Elle est pas belle, la vie&nbsp;? ;-)</i> ).
  </li>
  <li>
    Le <focus value="input#exercice_nb_mesures">champ &ldquo;Nombre de mesures&rdquo;</focus> vous laisse d&eacute;finir le nombre de mesures de l'exercice, permettant &agrave; &ldquo;Feuille de Route Musicale&rdquo; de vous confectionner des s&eacute;ances de travail dans un temps imparti. <strong>N'oubliez pas de compter TOUTES les mesures</strong>, c'est-&agrave;-dire en tenant compte de toutes les r&eacute;p&eacute;titions.
  </li>
  <li>
    Puis renseignez le <focus value="input#exercice_nb_temps">champ &ldquo;Nombre de temps par mesure&rdquo;</focus>.
    <br>
    <i>Notez que ce sont trois informations pr&eacute;c&eacute;dentes qui permettent &agrave; &ldquo;Feuille de Route Musicale&rdquo; de d&eacute;terminer la dur&eacute;e d'un exercice (votre tempo actuel, le nombre de temps par mesure et le nombre total de mesures dans l'exercice). Renseignez-les donc avec soin.
    <br> 
    Mais l'application est &ldquo;intelligente&rdquo;, elle prendra toujours en compte votre temps r&eacute;el de travail sur l'exercice. Ce qui signifie que plus vous jouez, et plus est juste le calcul du temps de travail pour la confection sur mesure d'une s&eacute;ance de travail.</i> 
  </li>
  <li>
    Vous pouvez ajouter une image (partition) de votre exercice gr&acirc;ce au <focus value="exercice_image">champ image</focus> suivant. Cette image peut &ecirc;tre bien s&ucirc;r un extrait de l'exercice en question, donc un extrait de la partition. <strong>Cette image est pour le moment d&eacute;sactiv&eacute;e</strong> , mais vous pouvez contacter Phil directement pour lui demander d'ajouter des images que vous lui transmettrez.
  </li>
  <li>
    Enfin, vous pouvez ajouter une note sur l'exercice gr&acirc;ce au <focus value="textarea#exercice_note">champ &ldquo;Note&rdquo;</focus>. Cette note peut &ecirc;tre une recommandation pour bien ex&eacute;cuter l'exercice ou le morceau, par exemple. &Ccedil;a peut &ecirc;tre aussi les recommandations de votre professeur. Au cours de votre travail, vous pourrez actualiser ce champ &agrave; mesure de la progression et des conseils que vous pourrez recevoir.
  </li>
  <li>
    Nous pouvez passer la rang&eacute;e &ldquo;Import&rdquo;, que vous pourrez aborder lorsque vous aurez d'autres feuilles de route, ou que vous connaitrez mieux l'application.
  </li>
</ul>
<div>
  En d&eacute;finitive, les seuls champs qui sont obligatoirement &agrave; d&eacute;finir pour cr&eacute;er un exercice sont : <strong>le titre de l'exercice</strong>  et <strong>le tempo maximum</strong>  (l'application refuse que les deux tempi, minimum et maximum, soient &eacute;quivalents &mdash;&nbsp;elle a de ses caprices, parfois&hellip;).
</div>
<div>
  Il ne vous reste plus qu'&agrave; cr&eacute;er l'exercice en cliquant sur <focus value="btn_exercice_save">le bouton &ldquo;Enregistrer ce nouvel exercice&rdquo;</focus>.
</div>
<div>Bravo &agrave; vous&nbsp;!</div>
<div>
  Vous pouvez poursuivre en en cr&eacute;ant d'autres (au moins deux ou trois si vous voulez poursuivre ce manuel), puis d&eacute;couvrir la <aide value="exercice/jouer_suite">mise en route des exercices</aide> ou la <aide value="seance/confection.html">confection d'une s&eacute;ance de travail</aide> (bien que cette confection ne soit vraiment int&eacute;ressante qu'avec un nombre suffisant d'exercices, c'est-&agrave;-dire un nombre d'exercices sup&eacute;rieur au temps imparti pour les travailler).
</div>