<div class="titre">Confection d'une s&eacute;ance de travail</div>
<div>&ldquo;Feuille de Route Musicale&rdquo; permet de confectionner pour vous des s&eacute;ances de travail adapt&eacute;es &agrave; votre temps disponible et les difficult&eacute;s particuli&egrave;res sur lesquelles vous voulez vous concentrer.
</div>
<div>
  Ces confections de s&eacute;ance de travail sont particuli&egrave;rement importantes lorsque le nombre d'exercices de votre feuille de route est sup&eacute;rieur au temps dont vous disposez pour les jouer. Gr&acirc;ce aux confections de s&eacute;ances, vous &ecirc;tes certain d'aborder tous vos exercices sans exception (en plusieurs s&eacute;ance, bien entendu).
</div>
<div class="soustitre">
  Demander la confection d'une s&eacute;ance de travail.
</div>
<div>
  Pour demander la confection d'une s&eacute;ance de travail, il vous suffit d'ouvrir votre feuille de route et de cliquer sur <focus value="a#btn_seance_show_form">le bouton de s&eacute;ance de travail</focus>.
</div>

<div class="soustitre">
  Param&egrave;tres d'une s&eacute;ance de travail
</div>
<div>
  Le premier param&egrave;tre, indispensable, r&egrave;gle la <strong>dur&eacute;e de la s&eacute;ance de travail</strong>. Choisissez simplement dans les menus heures et minutes le temps qui vous est imparti.
</div>
<div>
  Pour se focaliser sur une ou plusieurs difficult&eacute;s particuli&egrave;res, il suffit de cocher ses difficult&eacute;s dans la section &ldquo;Difficult&eacute;s&rdquo; du formulaire.
</div>
<div>
  Notez que si vous avez tir&eacute; vos exercices de la <aide value="">base de donn&eacute;es des exercices</aide>, les types sont d&eacute;finis. En revanche, si vous avez cr&eacute;&eacute; vous-m&ecirc;mes vos exercices, vous devez avoir r&eacute;gl&eacute; les param&egrave;tres &ldquo;difficult&eacute;s&rdquo; pour que Feuille de Route Musicale puisse s'en servir. Si &ccedil;a n'est pas le cas, &eacute;ditez vos exercices personnels et r&eacute;glez ces param&egrave;tres.
</div>

<div class="soustitre">
  Enregistrement d'une configuration de s&eacute;ance de travail
</div>
<div>
  @todo: &agrave; d&eacute;velopper
</div>